In [45]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import RidgeCV  # Linear least squares with l2 regularization
from sklearn.model_selection import train_test_split

In [46]:
data = pd.read_csv("housePrice.csv")
data.head()

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33

In [52]:
data["Warehouse"] = data["Warehouse"].replace([True,False],[1,0])
data["Elevator"] = data["Elevator"].replace([True,False],[1,0])
data["Parking"] = data["Parking"].replace([True,False],[1,0])

In [54]:
data.head()

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,1,1,1,Shahran,1.850000e+09,43999.998378
1,60,1,1,1,1,Shahran,1.850000e+09,43999.998378
2,79,2,1,1,1,Pardis,5.500000e+08,44000.005455
3,95,2,1,1,1,Shahrake Qods,9.025000e+08,44000.003324
4,123,2,1,1,1,Shahrake Gharb,7.000000e+09,44000.000429

In [48]:
data["Price(USD)"] = (data["Price"] / data["Price(USD)"]) + 14000 # update to july 2023

In [49]:
data["Price(USD)"].reset_index().head()

   index    Price(USD)
0      0  43999.998378
1      1  43999.998378
2      2  44000.005455
3      3  44000.003324
4      4  44000.000429

In [50]:
df = data[["Address", "Price(USD)"]]
df = df.sort_values(by="Price(USD)",ascending=False)
df.head(5)

     Address    Price(USD)
2765   Ozgol  44000.054546
2923  Parand  44000.012766
2731  Malard  44000.012000
2719  Parand  44000.012000
1515  Malard  44000.012000

In [58]:
X = data[["Area","Room","Parking","Warehouse","Elevator"]]
Y = data[["Price(USD)"]]